<template>
  <div class="lh-8">
    <h2 class="text-center mb-5">退款保障</h2>
    <p>Yohub网络加速器产品和服务属于虚拟商品，在符合下述条件的情况下，我们可以为您办理退款，您需要通过Yohub客户端或者Yohub官网提交退款工单，我们会协助您完成退款流程。</p>
    <h4>1、退款条件</h4>
    <div>
      1)购买渠道：从Yohub官网或Yohub客户端内购买的服务支持退款，在应用商店内购买或通过合作渠道、代理商购买的服务不支持退款；<br/>
      2)退款商品：同一个帐户仅支持首次购买套餐退款，续费套餐和增值业务订单不支持退款；<br/>
      3)退款价格：低于标价8折的或有特殊说明不支持退款的套餐不支持退款（如套餐包含赠送时长，赠送时长会被合并计算成折扣）；<br/>
      4)退款时限：购买低于30天的套餐不支持退款，购买90天套餐的退款时限为7天，购买180天套餐的退款时限为15天，购买360天以上套餐的退款时限为30天，退款时限从订单支付完成开始计算，超过退款时限后不支持退款；<br/>
      5)退款金额：用户停止服务的次日开始计算用户订单中剩余的有效权益，将剩余有效权益按日折算成订单可退还金额；<br/>
      6)用户未违反本协议3.1条所述的任何约定，否则将无法获得退款权益保障。<br/>
    </div>
    <h4> 2、退款方式 </h4>
    <div>
    1）用户提交退款工单并经Yohub客服确认满足退款条件后，Yohub客服将立即停止用户相应的帐户权限；<br/>
    2） Yohub客服会在5个工作日内，核算退款金额并按原支付路径完成退款；<br/>
    3） 退款过程中产生的其他费用，如手续费等由用户承担，退款时将在退款金额中扣除。<br/>
    </div>
  </div>
</template>
<script lang="ts" setup></script>
<style lang="less" scoped></style>
