<template>
  <div>
    <h2>用户协议 </h2>
    更新日期：2024-10-17 <br />
    前言<br />
    欢迎您安装试用/使用北京大河乐境科技有限公司（以下简称“大河乐境”或“我们”）提供的Yohub网络加速器产品和/或服务（以下统称“Yohub”或“服务”）！ <br />
    《用户协议》是大河乐境与您就Yohub网络加速器产品和/或服务的相关事项所订立的有效合约。安装试用/使用Yohub网络加速器产品或服务前，请您务必仔细阅读和理解本《用户协议》（以下简称“本协议”）的所有内容。如对相应条款有疑问，请联系我们进行询问，我们将向您进行解释和说明；如您无法准确理解我们对条款的解释和说明，或者您不同意本协议的任一内容，您应不再进行下一步或停止安装、试用或使用，请不要进行后续操作。您通过Yohub客户端APP或Yohub官网网站注册账号、点击确认、试用、实际购买或使用Yohub网络加速器表示您已阅读并充分理解本协议之内容，与大河乐境就使用相应服务和/或产品已达成合意，并同意接受本协议的全部约定内容，受其约束。
    <br />
    关于本协议，特别提示您关注：关于限制、免责、违规/违约行为的认定处理、以及管辖法院的选择等条款内容，前述条款可能以加粗及/或加下划线形式提示您注意。如果您未满18周岁，请在法定监护人的陪同下阅读本协议。<br />
   <h3> 1.服务内容</h3> 
    1.1 本协议中的“产品及/或服务”指：大河乐境向您提供的Yohub网络加速器产品和/或服务，具体服务内容以您所试用或订购的内容为准。<br />
    1.2 Yohub网络加速器仅供您在中国大陆境外使用，且仅限您用于个人娱乐、学习、工作、生活便利等合理需求，不得用于商业运营。<br />
    1.3 Yohub网络加速器可优化的网络服务包括但不限于：<br />
    在线音视频服务：主流的流媒体平台、视频播放服务等；<br />
    网络游戏：主流的在线游戏、手游等；<br />
    直播服务：主流的直播平台，包括但不限于娱乐、教育等类别的直播内容；<br />
    电商服务：主流的电子商务平台、在线支付平台；<br />
    生活服务：包括但不限于主流的学习、出行、通信、支付等日常生活服务类应用。<br />
    Yohub仅对明确支持的网络服务提供加速服务，对于未在支持服务范围内的网站、服务或应用程序，不提供任何形式的服务保证。我们将根据市场需求和技术能力，随时更新和调整支持的服务列表，具体支持服务范围以Yohub官方公布为准。
    <br />
    <h3>2.帐号的注册、使用</h3>
      2.1 帐户说明 <br />
        2.1.1
        “服务帐户”是由Yohub提供的一种身份识别服务，该身份识别服务能够使您登录到Yohub官方网站和客户端APP，并高效便捷地使用Yohub提供的服务。<br />
        2.1.2
        “服务帐户”服务中的某些部分可能会受到一些已经发布的指南、规定、其他条款以及条件的约束。因此作为本协议条款的引入内容，用户也应该遵守所有该等指南、规定、条款以及条件。如果本协议条款与其他指南、规定、条款以及条件之间存在冲突，则应该以本协议条款为准。然而，就“服务帐户”隐私声明涵盖的主体事项而言，《隐私政策》会取代本协议条款以及/或者其他所有针对于“服务帐户”隐私声明有关并且已经发布的指南、规定、条款以及条件中的冲突语言。<br />
      2.2 帐户注册资格 <br />
        2.2.1
        您确认，在您完成Yohub服务帐户注册程序以使用我们的产品和服务时，您应当为具备完全民事权利能力和完全民事行为能力的自然人（以下简称“您”）。<br />
        2.2.2
        若您是未成年人或限制民事行为能力人，则您不具备前述主体资格，您及您的监护人应承担您的不当注册行为而导致的一切后果。<br />
      2.3 帐户注册
        2.3.1当您根据注册页面提示填写信息、阅读并同意本协议条款且完成全部注册程序后，您可获得Yohub服务帐户并成为Yohub服务用户。<br />
        2.3.2
        您在注册时设置或确认的电子邮箱地址、第三方平台的身份信息及您设置的密码，将在注册成功后成为您的帐户（帐号及密码以下合称“帐户”）。<br />
        2.3.3
        您的帐户不得违反中华人民共和国法律法规、Yohub产品和服务管理规范，否则我们有权经通知您后予以注销您的帐户。<br />
        2.3.4
        Yohub可能会就某些软件、产品或服务的开通、使用，要求您提供更多的身份资料和信息，做进一步的身份认证或资格验证，您的帐户只有在通过这些认证和验证之后，方可获得使用相关软件、产品或服务的资格。<br />
        2.3.5
        您应当按照法律法规要求或相应页面的提示，提供并及时更新您的帐户信息。如您提供的帐户信息不符合法律法规或管理规范的要求，我们可以向您发出询问及/或要求改正的通知，您应按要求配合提供或更新相关资料。否则您应当承担不能使用Yohub服务帐户（不能注册成功、帐户被冻结和/或注销）或在使用过程中造成的后果和损失。<br />
        2.3.6
        您成为Yohub服务用户后，购买Yohub相关服务而索取发票，您承诺：对申请发票所提供的所有资料均真实、可信、完整，如有虚假，将承担相应的法律责任。<br />
        2.3.7
        您理解并同意，我们为保证您登陆Yohub相关服务平台、安装、使用软件、产品及服务，提供更为舒适的体验，可能会以电子邮件、站内信、短信、电话、系统信息以及即时通信等方式提示您进行下一步的操作或回访。<br />
      2.4 帐户使用与安全 <br />
      2.4.1
      Yohub服务密码由您自行设定。您同意妥善保管您的所有密码。我们不维护用户密码数据库，因此如果您未对您的密码和帐户信息保密，您将自行负责后果。<br />
      2.4.2
      您需要采取特定措施保护您使用的Yohub相关软硬件产品的安全，包括但不限于妥善保管软硬件与密码、安装防病毒木马软件、定期更改密码等措施。<br />
      2.4.3如您不慎丢失帐号和/或遗忘密码，须遵照Yohub的申诉途径及时申诉请求找回帐号。您可以凭初始注册资料及密码保护资料填写申诉向Yohub申请找回帐号，Yohub的密码找回机制仅负责识别申诉单上所填资料与系统记录资料的正确性，而无法识别申诉人是否系真正帐号权使用人。对因被他人冒名申诉而造成您的任何损失，我们不承担任何责任，您知晓Yohub服务帐号及密码保管责任在于您，我们并不承诺您的服务帐号丢失或遗忘密码后用户一定能通过申诉找回帐号。<br />
      2.5 帐户的冻结<br />
        您的Yohub服务帐户（全部或部分权限或功能）在如下情况可能被冻结，我们将以邮件、站内信、短信、电话、系统信息以及即时通信等方式通知您：<br />
        2.5.1
        违反中华人民共和国法律法规、政策、Yohub产品和服务管理规范和本协议条款的；<br />
        2.5.2
        您遭他人投诉，且对方提供相关法律执行文件冻结帐户，而您又未能按照我们的要求提供相反证据的；<br />
        2.5.3 我们根据合理分析判断您的帐户操作异常的； <br />
        2.5.4
        您向我们申诉他人未经您的授权使用您的Yohub服务帐户，且您能够提供证实帐户为您合法持有的证据的；<br />
        2.5.5 国家有关机构要求进行冻结的。 <br />
      2.6 帐户的注销 <br />
        2.6.1
        基于国家有权机关的要求，我们将配合注销您的帐户。我们将以邮件、站内信、短信、电话、系统信息以及即时通信等方式通知您。<br />
        2.6.2
        您在登录Yohub客户端APP或Yohub网站后确认注销的，或以邮件方式通知我们要求注销帐户，同时您能够提供证实帐户为您合法持有的证据的，我们将协助您完成注销。<br />
        2.6.3
        若您的帐户在3年内没有成功登录过Yohub网站或客户端APP，且您的帐户已超过付费服务期限，我们将视为您已经放弃您的Yohub帐户，我们有权在邮件通知您后注销您的帐户。<br />
      2.7 帐号申诉<br />
        发生本协议第2.5条和2.6条情况时，您应及时予以关注并按程序完成申诉等后续操作。<br />
        2.7.1
        为了您的帐户安全，您通过申诉程序，应配合并如实提供我们要求的身份证明及相关证明资料，以便我们进行核实。您应充分理解您的申诉并不必然被允许，我们有权决定是否同意您的申诉请求。<br />
        2.7.2
        您理解并同意，如果您拒绝如实提供身份证明及相关资料，或未能通过我们的审核，我们有权长期冻结该帐户且长期限制帐户部分或全部功能。<br />
    <br />
    <h3>3. 权利及义务</h3>
    3.1. 您的权利及义务 <br />
    3.1.1
    您应遵守本协议的约定。您还应仔细阅读并遵守您与Yohub的相关订购协议（如有）、Yohub官网和/或Yohub产品页面上展示的隐私政策、相应服务说明、技术规范、使用流程、操作文档等内容，并准确理解相关内容及可能发生的后果；在使用服务过程中，您应依照相关操作指引进行操作，对于您违反相关操作指引所引起的后果由您自行承担，我们不承担任何责任；请您自行把握风险谨慎操作。
    3.1.2
    您应向Yohub提交您的有效联系方式，如联系方式发生变动，您应自行将变动后的信息在线进行更新。因您提供的信息不真实、不准确、不完整，以及不作为而产生的任何后果，均由您自行承担。
    3.1.3 您承诺，不会利用Yohub产品或服务从事以下行为： <br />
    3.1.3.1
    利用Yohub产品或服务从事不正当的、禁止的、违法、犯罪或者欺诈活动，包括但不限于：使用网络爬虫、网络扫描技术进行网络探测或数据获取；扫描开放中继或开放代理；发送垃圾邮件或发送不受欢迎的、未经请求的电子邮件；使用网络伪装技术；使用被盗信用卡，从事信用卡欺诈、金融欺诈、加密货币欺诈行为；从事敲诈，勒索，绑架，色情，强奸，谋杀的行为；获取、提供或出售被盗信用卡、被盗商品、违禁品、军事和双重用途商品，获取、提供或出售受控物质；从事身份盗窃、黑客入侵、信息伪造、网络钓鱼行为；从事任何形式或规模的获取数字盗版、知识产权侵权和其他类似活动；
    3.1.3.2
    利用Yohub产品或服务从境外访问中华人民共和国法律法规明确禁止跨境访问的内容或服务；<br />
    3.1.3.3
    利用Yohub产品或服务上传（Upload）、下载（Download）、储存、发布如下信息或者内容，和/或为他人发布该等信息提供任何便利（包括但不限于设置URL、超链接等）：<br />
    （1）违反国家规定的政治宣传和/或新闻信息；<br />
    （2）涉及国家秘密和/或安全、颠覆国家政权、破坏国家统一、损害国家荣誉和利益的信息；<br />
    （3）非法、威胁、诽谤、反动、赌博、淫秽、色情、封建迷信的信息或教唆犯罪的信息；<br />
    （4）博彩有奖、赌博游戏、“私服”、“外挂”、电信诈骗等非法互联网活动信息；<br />
    （5）违反国家民族和宗教政策的信息； （6）妨碍互联网运行安全的信息；<br />
    （7）侵害他人合法权益，包括但不限于知识产权、商业秘密等权益的的信息和/或其他有损于社会秩序、社会治安、公共道德的信息或内容；<br />
    （8）发布或下载 BT 种子，或使用 eMule，迅雷，FlashGet 等 P2P 工具；<br />
    （9）发布破解器、注册机、发贴机、群发外链等信息；<br />
    （10）其他违反法律法规、部门规章或国家政策的内容。<br />
    您承认我们有权根据自己谨慎的判断来决定您或他人上传（Upload）、下载（Download）、储存、发布的信息或内容是否构成违反服务条款或者国家的有关规定。您承诺在接到我们的通知后会进行调整以符合国家规定或者本协议条款约定，否则我们有权终止本协议条款项下的产品和服务使用。<br />
    3.1.3.4 利用本系统可能存在漏洞以各种形式为自己及他人牟利； <br />
    3.1.3.5
    利用Yohub产品或服务从事任何违反《中华人民共和国网络安全法》、《中华人民共和国数据安全法》、《计算机信息网络国际联网安全保护管理办法》、《中华人民共和国个人信息保护法》、《信息安全技术个人信息安全规范》、《电信和互联网用户个人信息保护规定》、《关键信息基础设施保护办法》等国家有关法律法规和规范性文件的行为。<br />
    3.1.3.6
    大量占用，或使用可能导致程序或进程非正常大量占用Yohub云计算资源（如服务器计算资源、网络带宽、存储空间等）所组成的平台（以下简称“云平台”）中服务器内存、CPU或者网络带宽资源（包括但不限于互联网挖矿、BT下载等行为），给云平台或者Yohub的其他用户的网络、服务器、产品/应用等带来严重的负荷，影响Yohub与国际互联网或者Yohub与特定网络、服务器及Yohub内部的通畅连接，或者导致Yohub云平台服务或者Yohub的其他用户所使用的服务器宕机、死机或者用户基于云平台的产品/应用不可访问等；干扰或扰乱Yohub的服务或其他用户的正常使用的行为。<br />
    3.1.3.7
    进行任何破坏或试图破坏网络安全的行为（包括但不限于钓鱼，黑客，网络诈骗，网站或空间中含有或涉嫌散播：病毒、木马、恶意代码，及通过虚拟服务器对其他网站、服务器进行涉嫌攻击行为如扫描、嗅探、ARP欺骗、DDoS等）。<br />
    3.1.3.8 从事损害大河乐境和/或其关联公司合法权益之行为； 
    3.1.3.9
    进行任何改变或试图改变Yohub的系统配置或破坏系统安全的行为； 
    3.1.3.10
    您不得对Yohub提供的软件或者软件运行过程中释放到任何计算机终端内存中的数据及软件运行过程中客户端与服务器端的交互数据进行复制、更改、修改、挂接运行或创作任何衍生作品，形式包括但不限于使用插件、外挂或非经授权的第三方工具/服务接入软件和相关系统；<br />
    3.1.3.11 其他违反当地法律法规、部门规章或规范性文件、国家政策的活动。
    3.1.3.12
    您对违反本第3.13条的行为所产生的后果及对所发布、传输信息的内容所产生的影响、后果对大河乐境或有关第三方承担全部责任。您同意，发生上述事件，与大河乐境没有任何关系，大河乐境也不应对此或对第三方承担任何责任或者义务。<br />
    3.1.4
    您理解并同意，您有保守中华人民共和国的国家秘密、维护中华人民共和国国家安全的义务；您使用Yohub的产品或服务应遵守相关保密、国家安全法律法规的要求，并且不得危害中华人民共和国国家秘密的安全、不得从事危害国家安全的活动。<br />
    3.1.5
    若Yohub的产品或服务涉及第三方软件之许可使用的，您同意遵守相关的许可协议的约束。<br />
    3.1.6
    您应当保证您不会将您的Yohub帐户权限以任何方式转移、赠与、借用、租用、销售、转让给其他个人或企业。<br />
    3.1.7 您不得干扰Yohub正常地提供产品和服务，包括但不限于： <br />
    3.1.7.1
    攻击、侵入Yohub的服务器或终端程序或使服务器过载，或破坏其正常运行； <br />
    3.1.7.2
    破解、修改Yohub提供的客户端程序； <br />
    3.1.7.3
    利用Yohub程序的漏洞和错误（Bug）破坏软件产品的正常进行或传播该漏洞或错误（Bug）；<br />
    3.1.7.4 干扰或阻碍他人使用Yohub所提供的产品和服务。 <br />
    3.1.7.5
    探查、扫描、测试Yohub产品或服务网络的弱点或其它实施破坏网络安全的行为。 <br />
    <br />
    3.2.
    大河乐境的权利、义务 <br />
    3.2.1.
    大河乐境依据本协议和/或您与大河乐境签订的相关订购协议向您提供服务。 <br />
    3.2.2.
    您理解并确认，受技术所限，我们无法保证其所提供的服务毫无瑕疵（如Yohub的整体安全防护或安全功能并不能保证您的网络通信绝对安全、如技术迭代或服务设备更新后的服务可能不能在任何时候适配您的应用或软件），但我们承诺将不断提升服务质量及服务水平，为您提供更加优质的服务。据此，您同意：如果我们所提供的服务虽然存在瑕疵，但该等瑕疵是当时行业技术水平所无法避免的，其将不被视为我们违约。您同意和我们一同合作解决上述瑕疵问题。<br />
    3.2.3.
    大河乐境负责Yohub网络加速器客户端APP、Yohub互联网加速节点和Yohub官方网站的运营维护。Yohub网络加速器客户端APP、Yohub互联网加速节点和Yohub官方网站之外的部分（如您在终端上安装的其他应用程序）由您自行负责。此外，您自行升级我们提供的软硬件可能会造成宕机等不良影响，您应自行把握风险并谨慎操作。<br />
    3.2.4.
    您理解并认可，我们可能会根据您所订购的服务的类别、特性及规格等，对您使用服务的方式、范围、功能等进行限制，您应认真阅读我们关于您所订购服务的专有条款、使用文档及其他相关说明，理解并遵守该等使用限制；且您进一步同意，如果您所使用的服务超过其购买的服务规格，我们有权根据自己的判断，对您相关服务进行限制或暂停提供服务。<br />
    3.2.5.
    您理解并认可，我们将为您提供基于某些服务的安全防护以及管理与监控的相关功能及服务，尽管我们对该等服务经过详细的测试，但并不能保证其与所有的软硬件系统完全兼容，亦不能保证其软件及服务的完全准确性。如果出现不兼容及软件错误的情况，您应立即关闭或停止使用相关功能，并及时联系我们，获得技术支持。<br />
    3.2.6.
    如您违反3.1条所述的任何约定，我们有权根据情况采取包括但不限于立即删除相应被质疑/被投诉信息，限制、暂停或终止服务等处理措施；如果第三方机构或个人对您提出质疑或投诉，您有责任在规定时间内进行说明并出具证明材料，如您未能提供相反证据或您逾期未能反馈的，我们有权根据情况采取相应的处理措施，包括但不限于删除有害信息/程序、暂停或终止服务等。<br />
    <br />
     <h3>4. 业务数据 </h3>
    4.1
    我们理解并认可，您通过Yohub网络加速器访问、存储、上传、下载、分发以及通过其他方式处理的数据，均为您的业务数据。<br />
    4.2<br />
    您应对您的业务数据的来源及内容负责，我们提示您谨慎判断数据来源及内容的合法性。因您的业务数据内容违反法律法规、部门规章或国家政策而造成的全部结果及责任均由您自行承担。<br />
    <br />
    <h3>5. 知识产权 </h3>
    5.1.
    我们向您提供的Yohub产品和服务（包括但不限于任何资料、技术或技术支持、软件、服务）为大河乐境开发并所有，其一切版权、商标权、专利权、商业秘密等知识产权，以及与软件相关的所有信息内容，包括但不限于：文字表述及其组合、图标、图饰、图表、色彩、界面设计、版面框架、有关数据、印刷材料、或电子文档等均受中华人民共和国著作权法、商标法、专利法、反不正当竞争法和相应的国际条约以及其他知识产权法律法规的保护，除涉及第三方授权的软件或技术外，大河乐境享有上述知识产权。除大河乐境事先书面明示同意外，您无权复制、传播、转让、许可或提供他人使用上述知识成果，否则应承担相应的责任。<br />
    5.2.
    您不得修改、翻译、改编、出租、转许可或转让Yohub的服务或软件，逆向工程、反编译或试图以其他方式发现大河乐境提供的服务或软件的源代码。<br />
    5.3
    您应保证提供至Yohub的各项信息、上传至Yohub服务上的全部数据、对Yohub服务的使用，以及使用Yohub服务所涉及的素材不会侵犯任何第三方的合法权益；如有第三方就您所提供、上传或使用的信息、数据或就您的行为及成果向大河乐境提起任何投诉、索赔、诉讼或其他类型的诉求，则您理解并确认，您立即出面解决，并应赔偿大河乐境因此遭受的全部直接经济损失，包括但不限于各种费用、赔偿支出等。<br />
    5.4
    如果第三方机构或个人对Yohub服务的知识产权归属提出质疑或投诉，您应及时告知我们，我们将进行处理。<br />
    <br />
    <h3>6. 广告服务 </h3>
    6.1
    Yohub会在官方网站或APP上向用户展示广告、优惠和其他赞助内容，以帮助用户发现和使用Yohub产品或服务，以及我们的合作伙伴的商品、优惠或服务。<br />
    6.2
    我们的合作伙伴向我们付费以便向Yohub用户展示他们的内容，我们会谨慎设计所展示的广告信息，使所展示的内容与用户相关且对用户有用。<br />
    6.3
    您理解并接受，对于合作伙伴的广告Yohub仅提供广告信息的展示，并不对广告的内容负责。您与我们的合作伙伴发生的任何纠纷，由您和我们的合作伙伴双方负责解决，我们不承担任何责任，我们不为合作伙伴的商品或服务提供客服支持，若您需要获取支持，请与该商品、优惠和服务的提供商联系。<br />
    <br />
   <h3> 7. 退款保障</h3>
    Yohub网络加速器产品和服务属于虚拟商品，在符合下述条件的情况下，我们可以为您办理退款，您需要通过Yohub客户端APP或者Yohub官网提交退款工单，我们会协助您完成退款流程。<br />
    7.1退款条件：
    1)购买渠道：从Yohub官网或Yohub客户端APP内购买的服务支持退款，在应用商店内购买或通过合作渠道、代理商购买的服务不支持退款；<br />
    2)退款商品：同一个帐户仅支持首次购买套餐退款，续费套餐和增值业务订单不支持退款；<br />
    3)退款价格：低于标价8折的或有特殊说明不支持退款的套餐不支持退款（如套餐包含赠送时长，赠送时长会被合并计算成折扣）；<br />
    4)退款时限：购买低于30天的套餐不支持退款，购买90天套餐的退款时限为7天，购买180天套餐的退款时限为15天，购买360天以上套餐的退款时限为30天，退款时限从订单支付完成开始计算，超过退款时限后不支持退款；<br />
    5)退款金额：用户停止服务的次日开始计算用户订单中剩余的有效权益，将剩余有效权益按日折算成订单可退还金额；<br />
    6)用户未违反本协议3.1条所述的任何约定，否则将无法获得退款权益保障。 <br />
    7.2
    退款方式 <br />
    7.2.1
    用户提交退款工单并经Yohub客服确认满足退款条件后，Yohub客服将立即停止用户相应的帐户权限；<br />
    7.2.2 Yohub客服会在5个工作日内，核算退款金额并按原支付路径完成退款；<br />
     7.2.3
    退款过程中产生的其他费用，如手续费等由用户承担，退款时将在退款金额中扣除。<br />
    <br />
    <h3>8. 保密条款</h3> <br />
    8.1
    本协议所称保密信息，是指一方（以下简称“接受方”）从对方（以下简称“披露方”）取得的、获知的、或因双方履行本协议而产生的商业秘密（包括财务秘密）、技术秘密、经营诀窍和（或）其他应予保密的信息和资料（包括但不限于产品资料，产品计划，价格，财务及营销规划，业务战略，客户信息，客户数据，研发，软件，硬件，API应用数据接口，技术说明，设计，特殊公式，特殊算法等），无论上述信息和资料以何种形式或载于何种载体，无论披露方在披露时是否以口头、图像或书面等方式表明其具有保密性。
    8.2
    双方应采取适当措施妥善保存对方提供的保密信息，措施的审慎程度不少于其保护自身的保密信息时的审慎程度。双方仅能将保密信息用于与本协议项下的有关用途或目的。<br />
    8.3 本条上述限制条款不适用于以下情况： <br />
    8.3.1
    在签署或同意接受本协议之时或之前，该保密信息已以合法方式属接受方所有； <br />
    8.3.2
    保密信息在通知给接受方时，已经公开或能从公开领域获得； <br />
    8.3.3
    保密信息是接受方从与其没有保密或不透露义务的第三方获得的； <br />
    8.3.4
    在不违反本协议约定责任的前提下，该保密信息已经公开或能从公开领域获得； <br />
    8.3.5
    接受方应法院或其它法律、行政管理部门要求（通过口头提问、询问、要求资料或文件、传唤、民事或刑事调查或其他程序）因而透露保密信息；<br />
    8.3.6
    接受方为向行政管理部门、行业协会等机构申请某项业务资质、获得某项认定、或符合国家、行业标准/认证，需结合对方情况向前述机构提交材料或进行说明的而披露的信息，在该等情况下，接受方应秉持必要情况下最少披露原则及要求因此获知保密信息的机构按不低于本协议的标准予以保密。<br />
    8.4
    您和我们都应尽最大的努力保护上述保密信息不被披露。一旦发现有上述保密信息泄露事件，双方应合作采取一切合理措施避免或者减轻损害后果的产生。如因此给对方造成损失的，应赔偿因此给对方造成的直接经济损失。<br />
    <br />
    <h3>9. 服务期限</h3> <br />
    9.1
    您理解，如试用期届满而您未订购我们的服务、订购期限届满且经我们提醒您未及时续期的，服务期限终止。<br />
    9.2
    您理解并认可，为技术升级、服务体系升级、或因经营策略调整或配合国家重大技术、法规政策等变化，我们不保证永久的提供某种服务，或可能变更所提供服务的形式、规格或其他方面。<br />
    9.3 发生下列情形之一的，服务期限提前终止： <br />
    9.3.1 双方协商一致提前终止的；<br />
    9.3.2
    您严重违反本协议（包括但不限于，您严重违反相关法律法规规定，或您严重违反本协议项下之任一承诺内容等），我们有权提前终止服务；<br />
    9.3.3
    您理解并充分认可，虽然我们已经建立（并将根据技术的发展不断完善）必要的技术措施来防御包括计算机病毒、网络入侵和攻击破坏（包括但不限于DDoS）等危害网络安全事项或行为（以下统称“该等行为”），但鉴于网络安全技术的局限性、相对性以及该等行为的不可预见性，因此如因您的终端设备遭遇该等行为而给Yohub网络加速器产品和服务带来危害，我们可决定限制、暂停或终止服务。如果终止服务的，将按照实际提供服务月份计算（不足一个月的按天计）服务费用，将剩余款项（如有）返还。<br />
    <br />
    <h3>10. 违约责任</h3> <br />
    10.1 本协议任何一方违约均须依法承担违约责任。 <br />
    10.2
    您理解，鉴于计算机、互联网的特殊性，除不可抗力和意外事件外，下述情况亦不属于我们违约：<br />
    10.2.1
    我们在进行服务器、系统、Yohub网络加速器的其他软硬件配置、调试、维护和升级时，需要短时间中断服务的，不视为我们违约，但我们应当提前通知您，并在配置、调试、维护和升级完毕后尽快恢复服务；<br />
    10.2.2 由于Internet上的通路阻塞造成您网站访问、应用或服务运行等的速度下降。<br />
    10.3
    在适用法律允许的最大范围内，我们均不对任何间接性、特殊性、附带性、后果性、惩戒性的损失或损害，包括您使用Yohub网络加速器产品和服务而遭受的名誉损失、精神损失、利润损失、收入损失、业务优势的丧失或相关损害承担责任（即使您已被告知该等损失或损害的可能性）。<br />
    10.4
    在任何情况下，我们对本服务条款所承担的违约赔偿责任总额不超过违约服务对应之服务费总额。<br />
<br />
     <h3>11. 法律责任及其限制及免除</h3> <br />
    11.1
    您理解并同意，就您免费试（使）用服务期间，虽然我们会对服务可用性和可靠性提供支撑，但我们将不对任何服务可用性、可靠性做出承诺；我们亦不对您使用或不能使用Yohub产品和服务的结果承担任何责任。<br />
    11.2
    如您违反本协议或相关的服务条款的规定，我们有权视您的行为性质采取包括但不限于中断使用许可、停止提供服务、限制使用、法律追究等措施。同时，我们会视司法部门的要求，协助调查。<br />
    11.3
    由于服务及服务中所有数据和信息的传输都涉及到互联网服务因素，可能会受到各个环节不稳定因素的影响，存在因不可抗力、计算机病毒、黑客攻击、系统不稳定、您自身登录设备异常以及其他任何网络、技术、通信线路等原因造成的服务中断或不能满足用户要求的风险，您须明白并自行承担以上风险。<br />
    11.4
    您因第三方如电信部门的通讯线路故障、技术问题、网络、电脑故障、系统不稳定性及其他各种不可抗力原因而遭受的经济损失，我们不承担责任。<br />
    11.5
    因技术故障等不可抗事件影响到服务的正常运行的，我们承诺在第一时间内与相关单位配合及时处理进行修复，但您因此而遭受的经济损失，我们不承担责任。<br />
<br />
    <h3>12. 不可抗力和意外事件</h3> <br />
    12.1
    因不可抗力或者其他意外事件，使得本协议的履行不可能、不必要或者无意义的，遭受不可抗力、意外事件的一方不承担责任。<br />
    12.2
    不可抗力、意外事件是指不能预见、不能克服并不能避免且对一方或双方当事人造成重大影响的客观事件，包括但不限于自然灾害如洪水、地震、瘟疫流行等以及社会事件如战争、动乱、政府行为、电信主干线路中断、黑客、网路堵塞、电信部门技术调整和政府管制等。<br />
    
    <h3>13. 法律适用及争议解决</h3> <br />
    13.1
    本协议的订立、执行和解释及争议的解决均受中华人民共和国法律管辖。 <br />
    13.2
    因本协议引起的或与本协议有关的任何争议，双方应及时协商解决。协商不成的，任何一方均可提请北京仲裁委员会按照其仲裁规则进行仲裁。仲裁裁决是终局的，对双方均有约束力。<br />
    <br />
    <h3> 14 其他 </h3><br />
     14.1.
    大河乐境有权将本协议的权利义务全部或者部分转移给大河乐境的关联公司，同时关联公司不会实质性降低您可获得服务的质量。<br />
    14.2
    本协议所规定的任何条款的部分或全部无效者，不影响其它条款的效力。本协议项下之保密条款、知识产权条款、法律适用及争议解决条款等内容，不因本协议的终止而失效。<br />
    14.3
    若双方之间另有盖章文本，且与网络页面点击确认的本协议存在不一致之处，以双方盖章的文本内容为准。<br />
    <br />
  </div>
</template>
<script lang="ts" setup></script>
<style lang="less" scoped></style>
